Repository: GrzegorzFordon/GrzegorzFordon.github.io
Catalog: lib/l10n/app_*.arb
Languages: de

# welcome
source: Hi! I'm Grzegorz.
de: Hi! Ich bin Grzegorz.

# about_A
source: A full-stack developer with a focus on the
de: Full-Stack Entwickler mit Fokus auf das

# about_C
source: Based in Berlin, Germany
de: Wohnhaft in Berlin

source: Projects
de: Projekte

source: Personal
de: Persönliches

# promptwist_desc
source: Stuck on a blank page? Try PrompTwist! A modular, responsive app that combines random themes with random color palettes for a fresh idea each time.
de: Auf der Suche nach der nächsten Idee? PrompTwist schafft Inspirationen durch Verbindung von zufälligen Wörtern und Farbpaletten.

# promptwist_point_0
source: State management with Riverpod
de: State management via Riverpod

# promptwist_point_1
source: Cross platform - Released for Web, Mobile and Desktop
de: Cross platform - Veröffentlicht für Web, Mobile und Desktop

# stitchin_time_desc
source: Cross platform app for knitters/crocheters. Create charts using a fully-fledged pixel art editor, then switch to the row counter screen once ready to craft to let the app keep track of your progress.
de: Cross-Platform Helfer fürs Stricken/Häckeln. Erstelle Diagramme mit einem voll ausgestatteten Pixel-Art-Editor und wechsle dann, sobald du bereit bist, auf den Zeilenzähler, damit die App deinen Fortschritt verfolgen kann.

# stitchin_time_point_0
source: State management with Riverpod
de: State management via Riverpod

# stitchin_time_point_1
source: SQL database with Drift
de: SQL Datenbank mit Drift

# stitchin_time_point_2
source: Navigation with GoRouter
de: Navigation via GoRouter

# submeowsions_desc
source: My partner asked me to create a simple solution for keeping track of submissions to art/literature magazines. Submeowsions lets you curate your own database of works, publishers and submissions with quick options for accessing and editing submission data as well as a statistics page.
de: Mein Partner bat mich, eine einfache Lösung zu entwickeln, um Einreichungen bei Kunst- und Literaturmagazinen zu verfolgen. Submeowsions ermöglicht es, eine eigene Datenbank mit Werken, Verlagen und Einreichungen zusammenzustellen, mit schnellen Optionen zum Zugriff und Bearbeiten von Einreichungsdaten sowie einer Statistikseite.

# submeowsions_point0
source: State management with Riverpod
de: State management via Riverpod

# submeowsions_point1
source: Local storage and autosave with Hive
de: Speicher und Autosave mit Hive

# personal_desc
source: I enjoy playing board games and cooking with friends. Some of my current favourites to play are Scythe, Coup and the Android: Netrunner CCG. :) In my free time I do game development, including running a Discord server that focuses on helping new devs gain their skills quickly.
de: Ich spiele gerne Brettspiele und koche gerne mit Freunden. Zu meinen aktuellen Lieblingsspielen gehören Scythe, Coup und Android: Netrunner CCG. :) In meiner Freizeit bin ich hobby-mäßig als Spieleentwickler unterwegs, unteranderem auch als Admin eines Discord-Servers, der neuen Entwicklern dabei hilft, schnell ihre Fähigkeiten zu verbessern.
